{"errors": "replace", "bos_token": "<s>", "eos_token": "</s>", "sep_token": "</s>", "cls_token": "<s>", "unk_token": "<unk>", "pad_token": "<pad>", "mask_token": "<mask>", "add_prefix_space": false, "trim_offsets": true, "max_len": 512, "model_max_length": 512, "special_tokens_map_file": null, "name_or_path": "/content/drive/MyDrive/roberta-base-api-learning/Projects/Fine-Tuned-Model/checkpoint-11250", "tokenizer_class": "RobertaTokenizer"}